Tekla Open API Reference for Tekla Structures 2025
TeklaDrawingColor.DrawingColorEnum Property
 Enum for the drawing color
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingColors DrawingColorEnum { get; }
Public ReadOnly Property DrawingColorEnum As DrawingColors
	Get
Property Value
Type: DrawingColors
See Also
Reference
TeklaDrawingColor Structure
Tekla.Structures.Drawing Namespace